Revit 2024 API
FamilySymbol.IsActive Property
 Identifies whether the symbol is active.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsActive { get; }
Visual Basic
Public ReadOnly Property IsActive As Boolean
	Get
Visual C++
public:
property bool IsActive {
	bool get ();
}
Remarks
 Symbols that are not used in the document may be deactivated to conserve memory and regeneration time. When the symbol is inactive, its geometry is empty and cannot be accessed. In order to access the geometry of a symbol that is not active in the document, the symbol should first be activated by calling Activate().
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace